GT3/setup_TM/LES-wale/system/sample2
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |				
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  10                                  	
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       dictionary;
    object      sampleDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

type surfaces;
libs ("libsampling.so");

setFormat raw;

surfaceFormat raw;

interpolationScheme cell;

// Fields to sample.
fields
(
   //wallGradU U y kl kt nut omega 
   grad(U) U p nut 
);

// Surface sampling definition: choice of
//      plane : values on plane defined by point, normal.
//      patch : values on patch.
//
// 1] patches are not triangulated by default
// 2] planes are always triangulated
// 3] iso-surfaces are always triangulated
surfaces
(
   wall
   {
       type patch;
       patches  ("lowerWall");
       interpolate false;
   }

);

// *********************************************************************** //
